# Series and DataFrames

## Python Data Analysis Library = Pandas

In [13]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

## Series: indexes the values

In [9]:
x = Series([30, 40, 50])

In [10]:
x

0    30
1    40
2    50
dtype: int64

In [11]:
x.values

array([30, 40, 50])

In [12]:
x.index

RangeIndex(start=0, stop=3, step=1)

### Creating Series 
#### with CUSTOM index

In [14]:
Sales = Series([450000, 650000, 870000], index = ["Don", "Mike", "Edwin"])
Sales

Don      450000
Mike     650000
Edwin    870000
dtype: int64

In [16]:
type(Sales)

pandas.core.series.Series

#### Checking for a specific value

In [17]:
# use the index to retrieve the value of interest
Sales["Don"]

450000

#### Checking for conditions

In [20]:
Sales[Sales > 500000]

Mike     650000
Edwin    870000
dtype: int64

#### Checking for existence of value - returns a Boolean

In [24]:
"Don" in Sales

True

In [25]:
"John" in Sales

False

### Converting Series to dictionaries 
#### using the to_dict() function

In [31]:
Sales_dict = Sales.to_dict()
Sales_dict

{'Don': 450000, 'Mike': 650000, 'Edwin': 870000}

#### Converting dictionaries to Series

In [33]:
Sales_series = Series(Sales_dict)
Sales_series

Don      450000
Mike     650000
Edwin    870000
dtype: int64

#### Calling dictionaries into Series

In [35]:
Sales_dict

{'Don': 450000, 'Mike': 650000, 'Edwin': 870000}

In [36]:
# new index is defined
new_index = ["Don", "Mike", "Edwin", "John"]

# new Series made from the updated Series
NewSales = Series(Sales_dict, index = new_index)

In [37]:
NewSales

Don      450000.0
Mike     650000.0
Edwin    870000.0
John          NaN
dtype: float64

#### Finding NULL values

In [38]:
pd.isnull(NewSales)

Don      False
Mike     False
Edwin    False
John      True
dtype: bool

#### Adding values from two Series

In [41]:
Sales + NewSales

Don       900000.0
Edwin    1740000.0
John           NaN
Mike     1300000.0
dtype: float64

#### Setting the NAMES

In [42]:
# Naming a Series by:
NewSales.name = "Total Sales"
NewSales

Don      450000.0
Mike     650000.0
Edwin    870000.0
John          NaN
Name: Total Sales, dtype: float64

In [44]:
# Naming an index:
NewSales.index.name = "Sales Person"
NewSales

Sales Person
Don      450000.0
Mike     650000.0
Edwin    870000.0
John          NaN
Name: Total Sales, dtype: float64

## Creating a DataFrame (basically... a worksheet)

In [ ]:
# DataFrames are similar to Excel worksheets
# Both have rows and columns of data which you can then manipulate

#### from a *LIST*

In [67]:
data = [["Adrian", 20], ["Beatrice", 32], ["Chloe", 41]]
df = pd.DataFrame(data, columns = ["Name", "Age"], dtype = int)
df

       Name  Age
0    Adrian   20
1  Beatrice   32
2     Chloe   41

In [68]:
# This typecasts the FLOAT variables into integers
df["Age"] = df["Age"].values.astype(int)
df["Age"]

0    20
1    32
2    41
Name: Age, dtype: int64

#### from *DICTIONARIES*
#### USING DEFAULT INDEX

In [74]:
new = {"New": ["Tom", "Jack", "Steve", "Ricky"], "Sales": [25000, 30000, 35000, 40000]}
df2 = pd.DataFrame(new)
df2

     New  Sales
0    Tom  25000
1   Jack  30000
2  Steve  35000
3  Ricky  40000

#### CUSTOMISE INDEX VALUES

In [75]:
df2 = pd.DataFrame(new, index = ["rank1", "rank2", "rank3", "rank4"])
df2

         New  Sales
rank1    Tom  25000
rank2   Jack  30000
rank3  Steve  35000
rank4  Ricky  40000

#### from *LIST OF DICTIONARIES*
#### WITHOUT PASSING INDEX VALUE

In [73]:
data = [{"a": 1, "b": 2}, {"a": 5, "b": 10, "c": 15}]
df3 = pd.DataFrame(data)
df3

   a   b     c
0  1   2   NaN
1  5  10  15.0

#### BY APPLYING INDEX VALUES

In [77]:
data1 = [{"East": 15000, "West": 20000}, {"East": 5000, "West": 10500, "South": 20000}]
df4 = pd.DataFrame(data1, index = ["Sales1", "Sales2"], columns = ["East", "West"])
df4

         East   West
Sales1  15000  20000
Sales2   5000  10500

In [78]:
df4 = pd.DataFrame(data1, index = ["Sales1", "Sales2"], columns = ["East", "South"])
df4

         East    South
Sales1  15000      NaN
Sales2   5000  20000.0

In [79]:
df4 = pd.DataFrame(data1, index = ["Sales1", "Sales2"], columns = ["East", "West", "South"])
df4

         East   West    South
Sales1  15000  20000      NaN
Sales2   5000  10500  20000.0

#### from *DICTIONARY OF SERIES*

In [81]:
Sales = {"East": pd.Series([1000, 2000, 3000], index = ["Q1", "Q2", "Q3"]), 
        "West": pd.Series([15000, 25000, 35000, 45000], index = ["Q1", "Q2", "Q3", "Q4"])}

In [82]:
Sales_df5 = pd.DataFrame(Sales)
Sales_df5

      East   West
Q1  1000.0  15000
Q2  2000.0  25000
Q3  3000.0  35000
Q4     NaN  45000

#### Adding columns to the DataFrame

In [85]:
Sales_df5["South"] = pd.Series([17000, 27000, 37000], index = ["Q1", "Q2", "Q3"])
Sales_df5

      East   West    South
Q1  1000.0  15000  17000.0
Q2  2000.0  25000  27000.0
Q3  3000.0  35000  37000.0
Q4     NaN  45000      NaN

#### Adding values in the DataFrame

In [87]:
Sales_df5["North"] = Sales_df5["East"] + Sales_df5["West"]
Sales_df5

      East   West    South    North
Q1  1000.0  15000  17000.0  16000.0
Q2  2000.0  25000  27000.0  27000.0
Q3  3000.0  35000  37000.0  38000.0
Q4     NaN  45000      NaN      NaN

### Indexing and Reindexing OBJECTS

In [91]:
Sales = Series([450000, 650000, 870000], index = ["Don", "Mike", "Edwin"])
Sales

Don      450000
Mike     650000
Edwin    870000
dtype: int64

In [93]:
SalesReindexed = Sales.reindex(["Don", "Luke", "Edwin"])
SalesReindexed

Don      450000.0
Luke          NaN
Edwin    870000.0
dtype: float64

#### Replacing NULL values with zeros

In [95]:
SalesReindexed = Sales.reindex(["Don", "Luke", "Edwin"], fill_value = 0)
SalesReindexed

Don      450000
Luke          0
Edwin    870000
dtype: int64

### Indexing and Reindexing DATAFRAMES

In [116]:
data = {"County": ["Croydon", "Cornwall", "Hampshire"],
       "Year": [2011, 2013, 2014],
       "Sales": [20000, 35000, 45000]}

Sales_df6 = pd.DataFrame(data)
Sales_df6

      County  Year  Sales
0    Croydon  2011  20000
1   Cornwall  2013  35000
2  Hampshire  2014  45000

In [117]:
# This changes the order of the data
Sales_df6.reindex([2, 1, 0])

      County  Year  Sales
2  Hampshire  2014  45000
1   Cornwall  2013  35000
0    Croydon  2011  20000

In [118]:
# You cannot reindex RANDOM values!
Sales_df6.reindex([20, 30, 40])

   County  Year  Sales
20    NaN   NaN    NaN
30    NaN   NaN    NaN
40    NaN   NaN    NaN

In [119]:
# This changes the order of the columns
columnsTitles = ["Year", "Sales", "County"]
Sales_df6.reindex(columns = columnsTitles)

   Year  Sales     County
0  2011  20000    Croydon
1  2013  35000   Cornwall
2  2014  45000  Hampshire

### Dropping Index
### in Series

In [112]:
ser1 = Series(np.arange(3), index = ("aa", "bb", "cc"))
ser1

aa    0
bb    1
cc    2
dtype: int64

In [113]:
ser1.drop("cc")

aa    0
bb    1
dtype: int64

### in DataFrames

In [115]:
# the reshape function here shapes the data in a 3 by 3 formation
Sales_df7 = DataFrame(np.arange(9).reshape(3, 3), index = ["SF", "NYC", "BO"],
                     columns = ["Country", "Region", "Sales"])
Sales_df7

     Country  Region  Sales
SF         0       1      2
NYC        3       4      5
BO         6       7      8

In [120]:
Sales_df7.drop("SF")

     Country  Region  Sales
NYC        3       4      5
BO         6       7      8

## Selecting Entries

### in Series

In [121]:
ser2 = Series(np.arange(3), index = ["AA", "BB", "CC"])
ser2

AA    0
BB    1
CC    2
dtype: int64

In [122]:
ser3 = 2 * ser2
ser3

AA    0
BB    2
CC    4
dtype: int64

In [123]:
# This returns the value for BB
ser3["BB"]

2

In [130]:
# Can also use indexing method to retrieve the value
ser3[2]

4

In [128]:
ser3[0:2]

AA    0
BB    2
dtype: int64

In [131]:
# Can also specify multiple variables
ser3[["AA", "BB"]]

AA    0
BB    2
dtype: int64

#### Retrieving data using conditions

In [132]:
ser3[ser3 > 2]

CC    4
dtype: int64

In [134]:
# This replaces the value that satisfies the condition with the value 20
ser3[ser3 > 2] = 20
ser3

AA     0
BB     2
CC    20
dtype: int64

### in DataFrames

In [135]:
data = {"County": ["Croydon", "Cornwall", "Cumbria", "Durham", "Hampshire"],
       "Year": [2012, 2012, 2013, 2014, 2014],
       "Sales": [45000, 24000, 31000, 20000, 30000]}

Sales_df8 = pd.DataFrame(data)
Sales_df8

      County  Year  Sales
0    Croydon  2012  45000
1   Cornwall  2012  24000
2    Cumbria  2013  31000
3     Durham  2014  20000
4  Hampshire  2014  30000

#### Extracting from a SPECIFIC location

In [147]:
Sales_df8.iloc[2, 2]

31000

#### Extracting from a SPECIFIC column

In [139]:
Sales_df8["Year"]

0    2012
1    2012
2    2013
3    2014
4    2014
Name: Year, dtype: int64

#### Extracting MORE THAN ONE column

In [141]:
Sales_df8[["Year", "Sales"]]

   Year  Sales
0  2012  45000
1  2012  24000
2  2013  31000
3  2014  20000
4  2014  30000

#### Checking for values in the DataFrame, using a condition

In [143]:
Sales_df8[Sales_df8["Sales"] > 24000]

      County  Year  Sales
0    Croydon  2012  45000
2    Cumbria  2013  31000
4  Hampshire  2014  30000

#### Applying boolean to a DataFrame

In [145]:
Sales_df8["Sales"] > 25000

0     True
1    False
2     True
3    False
4     True
Name: Sales, dtype: bool

In [146]:
Sales_df8.loc[2]

County    Cumbria
Year         2013
Sales       31000
Name: 2, dtype: object